"""
Данный файл создан чтобы эмулировать работу с ФНС API.
Доступ к данной API у банка присутствует, но в рамках нашего проекта доступа к нему мы не имеем.

В данном файле будут реализованы стандартные функции, которые будут использоваться в проекте для работы с ФНС API.
- Поиск наличия ИНН в базе ФНС
- Получение информации о компании по ИНН
- Получение финансовой информации о компании по ИНН (для ООО)
"""



class FNSApi:
    def __init__(self):
        pass

    def check_inn_exists(self, inn: str) -> bool:
        """
        Проверяет наличие ИНН в базе ФНС.
        :param inn: ИНН компании
        :return: True если ИНН найден, False если не найден
        """
        

    def get_company_info(self, inn: str) -> dict:
        """
        Получает информацию о компании по ИНН.
        :param inn: ИНН компании
        :return: Словарь с информацией о компании
        """
        

    def get_financial_info(self, inn: str) -> dict:
        """
        Получает финансовую информацию о компании по ИНН (для ООО).
        :param inn: ИНН компании
        :return: Словарь с финансовой информацией о компании
        """
        